tap "homebrew/bundle"
tap "wata727/tflint"

# Command line
brew "fish"
brew "git"
cask "git-credential-manager"
brew "jq"
brew "coreutils"
brew "nginx"
brew "sshuttle"
brew "ag"
brew "tmux"
brew "reattach-to-user-namespace"
brew "tree"
brew "wget"
brew "openssl"

# Languages
brew "protobuf"
brew "asdf"

# Devtools
brew "protobuf"
brew "awscli"
cask "docker"
cask "emacs"
brew "kubectl"
brew "terminal-notifier"
brew "terraform"
brew "tflint"

# Others
brew "ollama"
brew "pkg-config"
