tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/versions"

# Command line
brew "fish"
brew "git"
brew "jq"
brew "md5sha1sum"
brew "nginx"
brew "sshuttle"
brew "ag"
brew "tmux"
brew "reattach-to-user-namespace"
brew "tree"
brew "wget"
brew "openssl"
brew "htop"

# Editors
brew "emacs"
cask "visual-studio-code"
cask "intellij-idea-ce"

# Languages
brew "go"
cask "java8"
brew "gradle"
brew "protobuf"
brew "python3"
brew "node"
brew "ruby"

# Apps
cask "iterm2"
cask "superduper"
cask "alfred"
cask "dropbox"
cask "typora"
cask "marked"

# Unproductivity
cask "vlc"

# Devtools
brew "ansible"
cask "docker"

# Browser
cask "google-chrome"
