tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/versions"
tap "wata727/tflint"

# Command line
brew "fish"
brew "git"
brew "jq"
brew "md5sha1sum"
brew "nginx"
brew "sshuttle"
brew "ag"
brew "tmux"
brew "reattach-to-user-namespace"
brew "tree"
brew "wget"
brew "openssl"

# Disabled until fixed in high sierra...
# brew "htop"

# Languages
brew "go"
cask "java8"
brew "gradle"
brew "protobuf"
brew "python3"
brew "node"
brew "ruby"

# Devtools
brew "ansible"
brew "awscli"
cask "docker"
cask "insomnia"
brew "kubectl"
brew "packer"
brew "terminal-notifier"
brew "terraform"
brew "tflint"
cask "visual-studio-code"
cask "tigervnc-viewer"

# Apps
cask "gitify"
